INSERT INTO author (first_name, middle_name, last_name)
			VALUES ('Джон','Рональд Руэл','Толкин'),
				   ('Френк','Патрик','Герберт'),
				   ('Говард','Филлипс','Лавкрафт'),
				   ('Стивен','Эдвин','Кинг'),
				   ('Эдгар','Аллан','По'),
				   ('Александр','Романович','Беляев'),
				   ('Александр','Сергеевич','Пушкин'),
				   ('Лев','Николаевич','Толстой'),
				   ('Анджей', NULL, 'Сапковский'),
				   ('Артур','Конан','Дойль');

INSERT INTO book ([name], author_id)
	      VALUES ('Властелин колец', 1),
				 ('Хоббит: Туда и обратно', 1),
				 ('Зов Ктулху', 3),
				 ('Дюна', 2),
				 ('Убийство на улице Морг', 5),
				 ('Голова профессора Доуэля', 6),
				 ('Война и мир', 8),
				 ('Анна Каренина', 8),
				 ('Дубровский', 7),
				 ('Ведьмак', 9),
				 ('Сказка о царе Салтане', 7),
				 ('Собака Баскервилей', 10),
				 ('ОНО', 4);

INSERT INTO dim_genre 
		    VALUES ('ужасы'),
			       ('фэнтези'),
				   ('детектив'),
				   ('роман'),
				   ('научная фантастика'),
				   ('рассказ'),
				   ('сказка');

INSERT INTO person 
		    VALUES ('1994-05-16','Гжегож','Бженчишчикевич', 'Богданович'),
				   ('1882-01-30','Франклин','Рузвельт', 'Делано'),
				   ('1911-02-15','Рональд','Рейган', 'Уилсон'),
				   ('1914-06-15','Юрий','Андропов', 'Владимирович'),
				   ('1894-04-15','Никита','Хрущев', 'Сергеевич');

INSERT INTO book_genre_lnk 
		    VALUES (1,2),
				   (2,2),
				   (3,1),
				   (4,5),
				   (5,3),
				   (6,5),
				   (7,4),
				   (8,4),
				   (9,4),
				   (10,2),
				   (11,7),
				   (12,3),
				   (13,1),
				   (5,6);

INSERT INTO library_card 
		    VALUES (10,1,'2021-03-16'),
				   (11,2,'2021-04-16'),
				   (7,3,'2021-01-16'),
				   (5,4,'2020-12-16'),
				   (13,5,'2021-05-05'),
				   (3,5,'2021-05-02'),
				   (1,5,'2021-05-06'),
				   (12,4,'2021-08-25'),
				   (4,5,'2021-07-25'),
				   (2,5,'2021-05-02');

